app/controllers/admin/songs_controller.rb

  def index
    @songs = Song.all.order(created_at: :desc)
---
SELECT "songs".* FROM "songs" ORDER BY "songs"."created_at" DESC

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "lyrics", "artist", "created_at", "updated_at") VALUES ('転生林檎', 'へいぼんなじぶんがいや なんでもないせいかつがいや', 'ピノキオピー', '2025-12-28 13:59:25.772195', '2025-12-28 13:59:25.772195') RETURNING "id"