app/controllers/game_records_controller.rb

INSERT INTO "game_records" ("player_name", "score", "played_at", "created_at", "updated_at") VALUES ('テスト', 0, '2025-12-28 13:42:56.161700', '2025-12-28 13:42:56.176173', '2025-12-28 13:42:56.176173') RETURNING "id"
---
  def show
    # 成績画面
    @player_name = session[:player_name]
    @score = session[:score] || 0

    # ゲーム記録を保存
    if @player_name.present?
      GameRecord.create(
        player_name: @player_name,
        score: @score,
        played_at: Time.current
      )