app/controllers/quizzes_controller.rb

  def start
    # ランダムな曲を取得
    song = Song.order("RANDOM()").first
---
SELECT "songs".* FROM "songs" ORDER BY RANDOM() LIMIT 1

  def answer
    song = Song.find_by(id: params[:song_id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = 7 LIMIT 1

  def search
    query = params[:q]

    if query.present?
      songs = Song.where("LOWER(title) LIKE ? OR LOWER(furigana) LIKE ?", "%#{query.downcase}%", "%#{query.downcase}%").limit(5)
    else
      songs = Song.order("RANDOM()").limit(5)
    end

    render json: songs.map { |s| { id: s.id, title: s.title } }
---
SELECT "songs".* FROM "songs" ORDER BY RANDOM() LIMIT 5
SELECT "songs".* FROM "songs" WHERE (title LIKE '%T%') LIMIT 5